Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: The contaminated air shall then be conducted to another cleaning device or directly to the atmosphere, or else the process or handling shall be discontinued.
sv: Frånluften ska då föras till en annan reningsanordning eller direkt till det fria eller så ska processen eller hanteringen stoppas.

source: Section 24 Contaminants from a process, handling or suchlike may not be conveyed, through return air or transferred air, to rooms where such contaminants are not normally generated.
sv: § Föroreningar från process, hantering eller dylikt får inte via återluft eller överluft föras till lokaler där sådan förorening normalt inte alstras.

source: Extract air containing substances included in Group A or Group B in Appendix 3 to the Work Environment Authority's regulations for hygienic limit values and measures against air contaminants biological agents of Risk Class 3 or 4 according to the Work Environment Authority's regulations for microbiological work environment risks - infection, toxin influence, hyper-sensitivity, or
sv: Frånluft som innehåller ämnen som är upptagna i grupp A eller B i bilaga 1 till Arbetsmiljö- verkets föreskrifter om kemiska arbetsmiljörisker, biologiska agens i riskklass 3 eller 4 enligt Arbetsmiljöverkets föreskrifter om mikrobiologiska arbetsmiljörisker – smitta, toxinpåverkan, överkänslighet eller

source: - welding smoke from permanently installed extractor may not be returned via return air or circulation air.
sv: svetsrök från fast installerat utsug får inte återföras via återluft eller cirkulationsluft.

source: Section 25 Process ventilation shall be in place where the contamination source so requires.
sv: § Processventilation ska finnas där föroreningskällan så kräver.

source: It shall be effective and designed with regard to how dangerous the air contaminant is.
sv: Den ska vara effektiv och utformad efter hur farlig luftföroreningen är.

source: It shall be permanently installed in workplaces where process ventilation is required more than temporarily and where the activity so allows.
sv: Den ska vara fast installerad vid arbetsplatser där processventilation behövs mer än tillfälligt och där arbetet så medger.

source: Otherwise, a mobile extractor shall be used.
sv: I annat fall ska mobilt utsug användas.

source: For fume cupboards, the front speed shall be at least 0.5m/s at the cupboard opening when work or processes generating air contaminants is in progress.
sv: För dragskåp ska fronthastigheten vara lägst 0,5 m/s i lucköppningen när ett arbete eller en process som alstrar luftföroreningar pågår.

source: In other cases, a basic flow is sufficient.
sv: I övriga fall räcker det med ett grundflöde.

source: Section 26 On premises where process ventilation is a prerequisite for ensuring dangerous levels of contaminants in the zone of occupation do not arise, any faults in the function of the ventilation system shall be shown by a control system.
sv: § I lokaler där processventilation är en förutsättning för att skadliga halter av föroreningar i vistelsezonen inte ska uppstå, ska eventuella fel i ventilationssystemets funktion visas av ett kontrollsystem.

source: If exposure to air contaminants can cause risk of death or serious injury, the control system shall also include an alarm.
sv: Om exponering för en luftförorening kan orsaka livsfara eller allvarlig skada ska kontrollsystemet även bestå av larm.

source: The alarm may be acoustic or visual, or both if necessary.
sv: Larmet ska vara akustiskt eller visuellt eller vid behov bådadera.

source: Maintenance and functional control
sv: Underhåll och funktionskontroll

source: Section 27 For ventilation systems there shall be written instructions in Swedish concerning operation and maintenance.
sv: § För ventilationssystem ska det finnas skriftliga drift- och underhållsinstruktioner på svenska.

source: Operating and maintenance personnel shall have sufficient knowledge of the ventilation system and shall have access to the instructions.
sv: Drift- och underhållspersonal ska ha tillräcklig kunskap om ventilationssystemet samt ha tillgång till instruktionerna.

source: The instructions shall apply solely to the ventilation system in question.
sv: Instruktionerna ska enbart gälla för det aktuella ventilationssystemet.

source: Section 28 Ventilation systems shall be inspected and maintained regularly.
sv: § Ventilationssystem ska kontrolleras och underhållas regelbundet.

source: Newly installed ventilation systems shall be inspected to verify that they function as intended before being commissioned.
sv: Nyinstallerade ventilationssystem ska kontrolleras så att de fungerar på avsett sätt innan de tas i bruk.

source: The documentation shall be available at the installation.
sv: Dokumentationen ska finnas tillgänglig vid anläggningen.

source: The ventilation and control system of fume cupboards shall be checked at least once a year to ensure they function as intended.
sv: Dragskåpets ventilation inklusive dess kontrollsystem ska kontrolleras minst en gång per år så att det fungerar på avsett sätt.

source: Thermal climate
sv: Termiskt klimat

source: Section 29 Premises that include workplaces or personnel facilities shall have a suitable thermal climate.
sv: § Lokaler som innehåller arbetsplatser eller personalutrymmen ska ha lämpligt termiskt klimat.

source: This shall be adapted to the nature of the work, according to whether the work is light or heavy and whether it involves movement or is sedentary.
sv: Klimatet ska vara anpassat till arbetets art, om arbetet är lätt eller tungt och om det är rörligt eller utförs stillasittande.

source: If it is impossible to create a suitable thermal climate throughout the premises for reasons of production technology, a suitable climate shall be aimed at in those parts of the premises where work is carried out primarily.
sv: Om det av produktionstekniska skäl är omöjligt att skapa ett lämpligt termiskt klimat i hela lokalen, ska ett lämpligt klimat eftersträvas i de delar av lokalen där arbete i huvudsak bedrivs.

source: If this cannot be arranged, other measures must be taken to reduce the risk of ill health and accidents.
sv: Om detta inte kan ordnas måste andra åtgärder vidtas för att minska risken för ohälsa och olycksfall.

source: Workplaces out of doors shall as far as possible be designed in such a way that the workers are protected against severe weather conditions.
sv: Arbetsplatser utomhus ska så långt som möjligt vara utformade så att de arbetande skyddas mot väder och vind.

source: Section 30 Heating installations shall as a rule be provided on all premises where work is done all the year round.
sv: § Värmeinstallationer ska i regel finnas i varje lokal där arbete utförs året runt.

source: On such premises, where a heating device or heating of the entire premises cannot reasonably be required, workplaces with sedentary or other physically less strenuous work shall be positioned in a heated space.
sv: I sådana lokaler, där det skäligen inte kan fordras uppvärmningsanordningar eller uppvärmning av hela lokalen, ska arbetsplatser med stillasittande eller annat fysiskt mindre ansträngande arbete placeras i uppvärmda utrymmen.

source: Section 31 If a permanent workplace is situated close to a door or gate leading outside or to a room with a significantly different temperature, there shall normally be protection against uncomfortable draught.
sv: § Om en permanent arbetsplats är placerad nära en dörr eller en port till det fria eller till en lokal med väsentligt annan temperatur ska det normalt finnas ett skydd mot besvärande drag.

source: Noise and acoustics
sv: Buller och akustik

source: Section 33 Installations shall be made and maintained in such a way that they generate and transmit as little noise to workplaces, work premises and personnel facilities as is practically possible.
sv: § Installationer ska vara utförda och underhållas så att de alstrar och överför så lite buller som är praktiskt möjligt till arbetsplatser, arbetslokaler och personalutrymmen.

source: Section 34 At the entrance to rooms, spaces or other places where there is a risk of hearing damage, there shall be a clearly visible compulsory sign displaying the symbol for “Risk of hearing damage – use ear protectors”.
sv: § Vid ingångarna till lokaler, utrymmen eller andra platser där det finns risk för hörselskada, ska det finnas en väl synlig påbudsskylt med symbolen för ”Hörselskydd måste användas”.

source: Electricity
sv: El

source: Section 35 Electrical systems shall be designed so as not to cause injury or give rise to ill health.
sv: § Elektriska system ska utformas så att de inte orsakar skada eller ger upphov till ohälsa.

source: Permanent workplaces shall not normally be positioned in the immediate vicinity of electrical installations where high current intensities or high voltages occur.
sv: Stadigvarande arbetsplatser ska normalt inte placeras i omedelbar närhet av elektriska anläggningar där höga strömstyrkor eller höga spänningar förekommer.

source: Electrical installations shall be made in such a way that the positioning of power sockets, the encapsulation of materials and suchlike permit good work environment conditions.
sv: Elektriska installationer ska utföras så att placeringen av uttag, kapslingen av material och liknande medger en god arbetsmiljö.

source: Installations for water, drainage, cooling and heating
sv: Installationer för vatten, avlopp, kyla och värme

source: Section 36 Tapping points for hot and cold water shall be provided where needed for the activities.
sv: § Tappställen för varmt och kallt vatten ska finnas där det behövs för verksamheten.

source: It shall be possible to wash hands in conjunction to the workplace if the activity so requires.
sv: Det ska vara möjligt att tvätta händerna i anslutning till arbetsplatsen om verksamheten så kräver.

source: The hot water system for showers shall be designed to stop the growth and spread of Legionella bacteria.
sv: Vid duschar ska varmvattensy- stemet utformas så att risken för tillväxt och spridning av legionellabakte- rier förhindras.

source: Drinking water shall be provided in a hygienic manner and within a distance which is reasonable, having regard to the nature of the work.
sv: Dricksvatten ska tillhandahållas på ett hygieniskt sätt och inom ett avstånd som är rimligt med hänsyn till verksamhetens art.

source: Tapping points with non-potable water shall be clearly marked so that they are not mistaken for tapping points for drinking water.
sv: Tappställen med icke drickbart vatten ska vara tydligt märkta så att de inte förväxlas med tappställen för dricksvatten.

source: For workplaces with a particularly great risk of burns, access to cold water shall be available at a short distance.
sv: Vid arbetsplats där det finns särskilt stor risk för brännskador ska det finnas tillgång till kallt rinnande vatten på kort avstånd.

source: Floors that need to be flushed or need run-off for other reasons shall normally have a floor drain and a suitable gradient leading to the same.
sv: Golv som behöver spolas eller av andra skäl behöver avrinning ska normalt ha golvbrunn och lämplig lutning mot denna.

source: If necessary there shall be a floor pit or gutter with drain.
sv: Om det behövs ska det finnas golvgrop eller golvränna med brunn.

source: Floor drains shall be accessible for cleaning.
sv: Golvbrunnar ska vara åtkomliga för rensning.

source: Over floor pits and large gutters where pedestrian traffic occurs there shall be non-slip floor gratings which are easy to lift.
sv: Över golvgropar och större golvrännor där gångtrafik förekommer ska det finnas halksäkra golvgaller som är lätta att lyfta upp.

source: Devices for removing floor gratings shall be easily accessible.
sv: Redskap för att lyfta golvgaller ska finnas lätt tillgängliga.

source: Section 37 Pipework and other installations shall be located and executed so that the risk of frostbite and burns is avoided.
sv: § Rörledningar och andra installationer ska vara placerade och utförda så att risken för kyl- och brännskador undviks.

source: If necessary to prevent any risk of injury, cold and hot surfaces shall be insulated or have a protection against unintentional touch.
sv: Kalla och heta ytor ska, om det behövs för att förhindra risk för skada, vara isolerade eller ha skydd mot oavsiktlig beröring.

source: Furnishings and equipment
sv: Inredning och utrustning

source: Section 38 Furnishings and equipment shall be selected according to the workers’ differing circumstances and the demands of their tasks.
sv: § Inredning och utrustning ska väljas med hänsyn till de arbetandes olika förutsättningar och de krav arbetsuppgifterna ställer.

source: A person who works mostly standing or walking shall have the possibility of sitting down.
sv: Den som i huvudsak arbetar stående eller gående ska ha möjlighet att sätta sig.

source: Section 39 Risks of ill health and accidents shall be taken into account in the selection and positioning of furnishings and equipment.
sv: § Risker för ohälsa och olycksfall ska beaktas vid val och placering av inredning och utrustning.

source: Floors, walls and roofs
sv: Golv, väggar och tak

source: Section 40 Floors shall be firm and stable and shall have a resilience appropriate to the activity.
sv: § Golv ska vara fasta och stabila och ha en för verksamheten lämplig svikt.

source: They may not have dangerous or unsuitable bumps, holes or slopes.
sv: De får inte ha farliga eller olämpliga upphöjningar, hål eller lutningar.

source: Cold and hot surfaces on floors and walls shall be insulated as necessary.
sv: Kalla och heta ytor på golv och väggar ska vid behov isoleras.

source: Section 41 On work premises where special danger occurs if persons or objects become electrostatically charged, the flooring, where necessary, shall be of material which leads off static electricity.
sv: § I lokaler med arbetsplatser och personalutrymmen där särskild fara uppstår om personer eller föremål laddas upp elektrostatiskt ska golvbeläggningen, där det behövs, vara utförd av material som leder bort statisk elektricitet.

source: Section 42 The surfaces of floors, walls and ceilings shall be such that they can be refurbished.
sv: § Ytskikten på golv, väggar och innertak ska kunna förnyas.

source: Floors, walls and ceilings shall be such that they can be cleaned without difficulty to the extent and in the manner which the activity demands.
sv: Golv, väggar och innertak ska utan svårighet kunna rengöras i den omfattning och på det sätt som verksamheten kräver.

source: Windows, doors and gates
sv: Fönster, dörrar och portar

source: Section 43 Windows and skylights shall where necessary have devices or be of a design that permits shading of sunlight.
sv: § Fönster och lanterniner ska vid behov ha anordningar eller vara utförda så att solinstrålning kan avskärmas.

source: Section 44 Windows which can be opened shall be such that they can be operated in a safe manner.
sv: § Fönster som är öppningsbara ska kunna manövreras på ett säkert sätt.

source: When open, they must not be positioned so as to entail a special risk of accidents.
sv: De får i uppställt läge inte medföra särskild risk för olycksfall.

source: Section 45 Windows and other glass surfaces shall be made in such a way or shall have such devices that they can be cleaned in a safe and ergonomically suitable manner.
sv: § Fönster och andra glasytor ska vara utförda på ett sådant sätt eller ha sådana anordningar att de kan rengöras på ett säkert och ergonomiskt lämpligt sätt.

source: Section 46 Doors and gates shall be suitably provided and arranged in terms of number, positioning, size and design.
sv: § Dörrar och portar ska vara lämpligt anordnade vad gäller antal, placering, storlek och utförande.

source: Section 47 Swing doors and swing gates shall be transparent or shall have a suitably positioned and designed see- through panel, having regard to the risk of collisions.
sv: § Pendeldörrar och pendelportar ska vara genomsiktliga eller ha en

source: They shall also be easy to open from inside.
sv: De ska vara lätta att öppna även inifrån.

source: Sliding doors and sliding gates shall be secured against being derailed and falling over.
sv: Skjutdörrar och skjutportar ska vara säkrade så att de inte spårar ur och välter.

source: Section 49 Doors for pedestrians must be provided in the immediate vicinity of any gates intended for vehicle traffic, unless it is safe for pedestrians to pass through.
sv: § Dörr för gående ska finnas i omedelbar närhet av varje port som är avsedd för fordonstrafik, om det inte är riskfritt för gående att passera genom porten.

source: Such doors must be clearly marked and left permanently unobstructed.
sv: Sådana dörrar för gående ska vara tydligt markerade och får inte blockeras.

source: Section 50 Where necessary, having regard to traffic conditions, barriers or railings for the protection of pedestrians shall be provided on both sides of gates.
sv: § På båda sidor om portar ska det finnas avvisare eller räcken till skydd för de gående om det behövs på grund av trafiken.

source: Traffic routes, passage ways and corridors
sv: Transportvägar, gångar och korridorer

source: Section 51 Traffic routes for heavy transport shall normally be designed so as to permit wheeled transport.
sv: § Transportvägar för tyngre transporter ska normalt vara utformade så att de medger transporter på hjul.

source: Section 52 Transport operations between different levels shall be possible by means of a lift or other suitable transport device if the operations are so heavy or frequent that manual lifting, carrying or other manual handling entails a risk of ill health due to unsuitable physical loads or a risk of accidents.
sv: § Transporter mellan olika plan ska kunna ske med hiss eller annan lämplig lyftanordning om de är så tunga eller förekommer så ofta att manuella lyft, bärande eller annan manuell hantering medför risk för ohälsa genom olämplig belastning eller risk för olycksfall.

source: Section 53 Communication routes for pedestrian or goods traffic shall be dimensioned in accordance with the number of potential users and the type of activity.
sv: § Förbindelseleder för gångtrafik eller gods ska dimensioneras efter antalet arbetstagare och verksamhetens art.

source: Section 54 If both vehicle and pedestrian traffic occur on traffic routes, sufficient safety clearance shall be provided between pedestrians and vehicle traffic.
sv: § Om både fordons- och gångtrafik förekommer på förbindelselederna ska det finnas ett tillräckligt säkerhetsavstånd mellan gående och fordonstrafik.

source: Sufficient clearance shall be allowed between vehicle traffic routes and doors, gates, pedestrian crossings, corridors and staircases, so as to avoid any danger to pedestrians.
sv: Ett tillräckligt stort fritt utrymme ska finnas mellan vägen för fordonstrafik och dörrar, portar, övergångsställen, korridorer och trappor så att fara för gående undviks.

source: Pedestrian traffic shall be separated from vehicle traffic on corners.
sv: Vid hörn ska gångtrafiken vara avskild från fordonstrafiken.

source: If necessary, a traffic mirror shall be provided.
sv: Där det behövs ska det finnas en trafikspegel.

source: Section 55 For the protection of workers, the traffic routes shall be clearly marked where necessary.
sv: § För att skydda dem som arbetar ska förbindelselederna vara tydligt

source: Section 56 Single steps, as well as thresholds in corridors and passageways, shall normally be avoided.
sv: § Enstaka trappsteg liksom trösklar i korridorer och gångar ska normalt inte förekomma.

source: Staircases and fixed ladders
sv: Trappor och fasta stegar

source: Section 57 Staircases shall be adequate from a safety viewpoint and shall be dimensioned according to the number of workers and the nature of the activity.
sv: § Trappor ska vara betryggande ur skyddssynpunkt och dimensionerade efter antalet som arbetar och verksamhetens art.

source: Section 58 Between a door and a staircase leading downwards or a single step, there shall be a landing of adequate size, having regard to the risk of falls.
sv: § Mellan en dörr och en nedåtgående trappa eller ett enstaka trappsteg ska det finnas ett trapplan som är tillräckligt stort utifrån risken för fall.

source: Section 59 For access to platforms, balconies and suchlike spaces there shall be a fixed access arrangement.
sv: § För tillträde till plattformar, balkonger och liknande utrymmen ska det finnas en fast uppstigningsanordning.

source: A staircase should be the first choice.
sv: I första hand ska en trappa väljas.

source: A fixed ladder more than 6 metres high shall have a guard for the prevention of falls.
sv: En fast stege som är högre än 6 m ska ha skydd som hindrar fall.

source: Goods intakes, loading bays and ramps
sv: Varumottag, kajer och ramper

source: Section 60 Workplaces and work premises shall where necessary have goods intakes.
sv: § Till arbetsplatser och arbetslokaler ska det när det behövs finnas va- rumottag.

source: These shall be positioned and arranged in such a way and maintained in such condition that the handling of goods can proceed in a way which is physically harmless to the persons delivering and receiving goods.
sv: Dessa ska vara så placerade och anordnade och hållas i sådant skick att varorna kan hanteras på ett för kroppen skonsamt sätt för dem som levererar och tar emot varor.

source: Goods intakes shall be provided with sufficient space for the stationing of goods and load carriers.
sv: Vid varumottag ska det finnas tillräckligt med uppställningsplats för gods och lastbärare.

source: A loading bay shall be provided where necessary.
sv: Där det behövs ska det finnas en lastkaj.

source: Section 61 Loading bays shall be positioned and designed in such a way as to avoid danger to neighbouring traffic and pedestrian traffic.
sv: § Lastkajer ska vara placerade och utformade så att angränsande trafik och gångtrafik inte utsätts för fara.

source: Section 62 Loading bays shall have sufficient space for work and goods and shall be suited to the nature, scale and equipment of the work.
sv: § Lastkajer ska ha tillräckligt utrymme för arbete och gods och vara avpassade till arbetets art, omfattning och utrustning.

source: They shall have at least one access route from the ground, normally a flight of steps with a handrail.
sv: De ska ha minst en tillträdesled från marken, normalt en trappa med ledstång.

source: At the edge, where there is a risk of vehicles falling down and where considerations of goods handling permit, loading bays shall have safety barriers.
sv: Vid kanter, där det finns risk för att fordon störtar ned, ska lastkajer ha avkörningsskydd om sådana inte hindrar hanteringen av gods.

source: These safety barriers shall be at least 0.3 metres high.
sv: Avkör- ningsskyddens höjd ska vara minst 0,3 meter.

source: The barriers shall carry warning markings and shall be constructed so as to prevent vehicles from falling when inadvertently running or sliding into them.
sv: Skydden ska vara varnings- markerade och så utförda att de hindrar nedstörtning av fordon som oavsiktligt körs eller glider mot dem.

source: Section 63 Outdoor loading bays adjacent to a building shall normally have a roof affording protection from precipitation and falls of snow.
sv: § Lastkajer utomhus intill en byggnad ska normalt ha tak som skyddar

source: Where necessary they shall have an appropriate pitch for water run-off.
sv: Lastkajer ska där det behövs ha lämplig lutning så att vatten kan rinna av.
